var dinosaurs = ["Тиранозавр", "велоцираптор", "Стегозавр", "Трицераптос", "Брахиозавр", "Птеранодон", "Апатозавр", "Диплодок", "Компсогнат"];
dinosaurs[3,4];
"Брахиозавр"
dinosaurs[1] = "Велоцираптор";
"Велоцираптор"
dinosaurs;
(9) ["Тиранозавр", "Велоцираптор", "Стегозавр", "Трицераптос", "Брахиозавр", "Птеранодон", "Апатозавр", "Диплодок", "Компсогнат"]
var fruits = [];
fruits[0] = "Яблоко";
fruits [1] = "Груша";
fruits[2] = "Апельсин";
fruits [3] = "Манго";
fruits [4] = "Авокадо";
fruits [5] = "Банан";
fruits [6] = "Ананас";
fruits [7] = "Киви";
fruits;
(8) ["Яблоко", "Груша", "Апельсин", "Манго", "Авокадо", "Банан", "Ананас", "Киви"]0: "Яблоко"1: "Груша"2: "Апельсин"3: "Манго"4: "Авокадо"5: "Банан"6: "Ананас"7: "Киви"length: 8__proto__: Array(0)
fruits [3];
"Манго"
fruits.length;
8
fruits [fruits.length - 1];
"Киви"
fruits.push ("Грейпфрукт");
9
